Simulations Results/MeshConvergence02/mesh_45/Results/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
98679
(
(4.9847607 -0.032583093 -0.022805264)
(4.983137 -0.013980769 0.025395518)
(4.98859 -0.0038710764 0.078078132)
(4.979764 -0.013881552 0.031772397)
(4.9944846 -0.034453084 0.011255402)
(4.9828171 -0.014933646 -0.0063950701)
(5.0088124 -0.0092946625 0.0079700077)
(5.0036315 -0.018440158 -0.014542315)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedNormalInletOutletVelocity;
        fixTangentialInflow yes;
        normalVelocity
        {
            type            fixedValue;
            value           uniform (5 0 0);
        }
        value           uniform (5 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
640
(
(5.032368 -0.035556369 0.036055347)
(5.0384954 -0.094257626 0.097145534)
(5.0066682 -0.14645884 0.080090781)
(5.093256 -0.069456535 0.032562374)
(5.1222714 -0.135804 0.0048659539)
(5.1069058 -0.1660695 0.082099912)
(5.0747042 -0.23483557 0.083734442)
(5.1341012 -0.2365884 0.032248174)
...
)
;
    }
    wall
    {
        type            slip;
    }
    constraint
    {
        type            symmetry;
    }
    defaultFaces
    {
        type            slip;
    }
}


// ************************************************************************* //
