Simulations Results/MeshConvergence02/mesh_45/Results/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          640;
        startFace       289104;
    }
    outlet
    {
        type            patch;
        nFaces          640;
        startFace       289744;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7122;
        startFace       290384;
    }
    constraint
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          4224;
        startFace       297506;
    }
    defaultFaces
    {
        type            patch;
        nFaces          12921;
        startFace       301730;
    }
)

// ************************************************************************* //
